"""
类:描述的是一组具有相同属性和方法的模板
对象:对象是类的实例,是基于类创建出来的实例对象,创建对象的过程,也称为对象的实例化,一个类可以创建无数个对象
类的命名规范:大驼峰命名法,单词首字母大写,单词之间无分隔符
定义类的语法:
#定义类 ------>动态的为对象添加属性(不推荐)
class 类名:
    #类的结构,最简单为没有结构pass
    pass

#创建对象
对象名 = 类名()
对象名.属性名1 = 属性值1
对象名.属性名2 = 属性值2

__dict__是Python中用户自定义类的一个特殊属性,用于以字典形式存储对象的属性

定义类时指定实例属性(def定义在类的外面称为函数,定义在类之中称之为方法)
#定义类
class 类名:
    def __init__(self,参数列表):
    # __init__:初始化方法,对象创建后自动调用,用于设置对象的初始状态(对象的属性)
    # self:方法的第一个参数,表示当前创建的实例对象
        self.属性名 = 参数值
        self.属性名 = 参数值
#创建对象
对象名 = 类名(参数列表)

1.面向对象是什么:
面向对象是一种编程思维,是对面向过程的再次封装处理,通过对象来模拟现实世界
2.面向对象的三大特性:
封装:封装对象的属性和方法,仅对外公开接口
继承:子类继承父类的属性和方法,使得子类对象具有父类的特征和行为
多态:不同类的对象对同一消息做出的响应是不一样的
"""
# 定义类 ---->动态添加对象的属性(不推荐)
class Car1:
    pass
# 创建对象
c1 = Car1()
# 动态的为对象添加属性
c1.color = "red"
c1.brand = "BMW"
c1.name = "X5"
c1.price = 500000

print(c1)
print(c1.color)
print(c1.__dict__)
print(type(c1.__dict__))#会将对象中的所有属性以字典的形式输出出来

#定义类 ------>定义类时指定实例属性
class Car:
    def __init__(self, color, brand):
        self.color = color
        self.brand = brand
        print("Car类型的对象初始化完毕,对象属性已经添加完毕")
c10 = Car("红色", "bwm")
print(c10.__dict__)
print(type(c10.__dict__))
print(c10.color)
print(type(c10.color))